Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotOverlapBoundingElement Property
 An error occurred while trying to find the region where a face of the bounding geometry for [Room] overlaps a face of a room-bounding element [Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomGeometryCannotOverlapBoundingElement { get; }
Public Shared ReadOnly Property RoomGeometryCannotOverlapBoundingElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomGeometryCannotOverlapBoundingElement {
	FailureDefinitionId^ get ();
}
static member RoomGeometryCannotOverlapBoundingElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace